using UniRx;
using SubmarineMirage.Base;
namespace TatemonSugoroku.Scripts {
	///========================================================================================================
	/// <summary>
	/// ■ 背景のモデルクラス
	/// </summary>
	///========================================================================================================
	public class BackgroundModel : SMStandardBase, IModel {
		///----------------------------------------------------------------------------------------------------
		/// ● 要素
		///----------------------------------------------------------------------------------------------------
		/// <summary>画像を変更する際の、通知</summary>
		public readonly Subject<Unit> _changeImage = new Subject<Unit>();

		///----------------------------------------------------------------------------------------------------
		/// <summary>
		/// ● コンストラクタ
		/// </summary>
		///----------------------------------------------------------------------------------------------------
		public BackgroundModel() {
			_disposables.AddFirst( () => {
				_changeImage.Dispose();
			} );
		}
		public void Initialize( AllModelManager manager ) {
		}

		///----------------------------------------------------------------------------------------------------
		/// <summary>
		/// ● 画像変更の要求を通知
		/// </summary>
		///----------------------------------------------------------------------------------------------------
		public void ChangeImage() {
			_changeImage.OnNext( Unit.Default );
		}
	}
}